Tekla.Structures.Geometry3d.SolidEx.EdgeComparer
Defines methods to geometrically compare two edges segments for equality to within the model tolerance.

Tekla.Structures.Geometry3d.SolidEx.EdgeComparer.GetHashCode(Tekla.Common.Geometry.Segment3)
Gets the hash code of the segment.
obj: The segment.
Returns: A constant value so that the Equals method is always used.

Tekla.Structures.Geometry3d.SolidEx.EdgeComparer.Equals(Tekla.Common.Geometry.Segment3,Tekla.Common.Geometry.Segment3)
Compares two segments for equality to within model tolerance.
x: The first segment.
y: The second segment.
Returns: A value indicating whether the segments are equal.